In [0]:
import pandas as pd

In [0]:
train_df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')

In [97]:
train_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [98]:
test_df.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [99]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [100]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [0]:
# Excluindo dados desnecessários
train_df.drop(['Name', 'Cabin', 'Ticket'], axis=1, inplace=True)
test_df.drop(['Name', 'Cabin', 'Ticket'], axis=1, inplace=True)

In [0]:
# Tratando variáveis dummies
train_df = pd.get_dummies(train_df)
test_df = pd.get_dummies(test_df)

In [103]:
# Tratando valores nulos

train_df.isnull().sum().sort_values(ascending=False)

Age            177
Embarked_S       0
Embarked_Q       0
Embarked_C       0
Sex_male         0
Sex_female       0
Fare             0
Parch            0
SibSp            0
Pclass           0
Survived         0
PassengerId      0
dtype: int64

In [104]:
test_df.isnull().sum().sort_values(ascending=False)

Age            86
Fare            1
Embarked_S      0
Embarked_Q      0
Embarked_C      0
Sex_male        0
Sex_female      0
Parch           0
SibSp           0
Pclass          0
PassengerId     0
dtype: int64

In [0]:
# Substituindo idade em branco pela média

train_df.fillna(train_df['Age'].mean(), inplace=True)
test_df.fillna(test_df['Age'].mean(), inplace=True)

In [0]:
# Preço da passagem

test_df.fillna(test_df['Age'].mean(), inplace=True)

In [0]:
# Criação das variáveis para classificar o modelo
X = train_df.drop('Survived', axis=1)
y = train_df['Survived']

In [109]:
from sklearn.ensemble import RandomForestClassifier as RFC
tree = RFC(max_depth=10, random_state=4)
tree.fit(X, y)

tree.score(X, y)

/usr/local/lib/python3.6/dist-packages/sklearn/ensemble/forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

0.9304152637485971

In [0]:
predict = tree.predict(test_df)

result = pd.DataFrame()
result['PassengerId'] = test_df['PassengerId']
result['Survived'] = predict

In [0]:
result.to_csv('subission.csv', index=False)